{
    "posts": [
        {
            "title": "Today's Featured Project: Be Productive Using a Pomodoro Clock",
            "date": "2020-04-12",
            "entry": "<p>Pomodoro clocks allow you to alternate between working a 25-minute session and taking a five-minute break. I have implemented my own pomodoro clock using the React and Redux JavaScript libraries.</p><h4>What I Learned</h4><p>Here are some of the skills that I learned while creating this heat map:</p><ul><li><em>Creating the interface.</em> I used a simple, clean interface for this project. I researched the HTML entity for the up and down arrows. I used rounded corners for the clock's remaining time display.</li><li><em>Using the React library.</em> The React code handles all of the button clicks and displays the various text and values such as the time remaining.One of the trickier parts of this project is handling what happens when the start/pause button is pressed. I decided to let React handle the logic to check whether the clock should start a new alarm or pause the current alarm.</li><li><em>Using the Redux library.</em> I used Redux to handle the app's state, including changing the break and session lengths and handling the remaining time left.</li><li><em>Using React-Redux.</em> React-Redux handles the JavaScript setInterval call that occurs when the user starts a new alarm.</li><li><em>Implementing helper functions.</em> I wrote helper functions in vanilla JavaScript to play the alarm when time is up; rewind the alarm if the reset button is pressed; convert the number of seconds remaining into minute/second format using a JavaScript object; and determining whether to display a leading zero or the \"60\" if the session or break length is 60 minutes long.</li></ul><h4>Takeaways</h4><p>I learned how to properly call the setInterval function in a React-Redux project.I also strengthened my overall knowledge of React and front-end programming.React will be useful for creating JavaScript apps that require user interactions, such as forms, interactive graphs, simulations, and games.</p>"
        },
        {
            "title": "Today's Featured Project: Visualizing Data Using a Heat Map",
            "date": "2020-04-06",
            "entry": ""
        },
        {
            "title": "First Project Uploaded: Choropleth Map - Data Visualization",
            "date": "2020-04-05",
            "entry": ""
        },
        {
            "title": "Hello!",
            "date": "2020-04-04",
            "entry": ""
        }
    ]
}